Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.10/PIC32CK-SG01/atdf/PIC32CK1025SG01100.atdf
        <register name="BCFT" offset="0x110C" rw="R" size="4" initval="0x00000000" caption="Broadcast Frames Transmitted Register">
          <bitfield name="BFTX" caption="Broadcast Frames Transmitted without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="MFT" offset="0x1110" rw="R" size="4" initval="0x00000000" caption="Multicast Frames Transmitted Register">
          <bitfield name="MFTX" caption="Multicast Frames Transmitted without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="PFT" offset="0x1114" rw="R" size="4" initval="0x00000000" caption="Pause Frames Transmitted Register">
          <bitfield name="PFTX" caption="Pause Frames Transmitted Register" mask="0xFFFF"/>
        </register>
        <register name="BFT64" offset="0x1118" rw="R" size="4" initval="0x00000000" caption="64 Byte Frames Transmitted Register">
          <bitfield name="NFTX" caption="64 Byte Frames Transmitted without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="TBFT127" offset="0x111C" rw="R" size="4" initval="0x00000000" caption="65 to 127 Byte Frames Transmitted Register">
          <bitfield name="NFTX" caption="65 to 127 Byte Frames Transmitted without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="TBFT255" offset="0x1120" rw="R" size="4" initval="0x00000000" caption="128 to 255 Byte Frames Transmitted Register">
          <bitfield name="NFTX" caption="128 to 255 Byte Frames Transmitted without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="TBFT511" offset="0x1124" rw="R" size="4" initval="0x00000000" caption="256 to 511 Byte Frames Transmitted Register">
          <bitfield name="NFTX" caption="256 to 511 Byte Frames Transmitted without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="TBFT1023" offset="0x1128" rw="R" size="4" initval="0x00000000" caption="512 to 1023 Byte Frames Transmitted Register">
          <bitfield name="NFTX" caption="512 to 1023 Byte Frames Transmitted without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="TBFT1518" offset="0x112C" rw="R" size="4" initval="0x00000000" caption="1024 to 1518 Byte Frames Transmitted Register">
          <bitfield name="NFTX" caption="1024 to 1518 Byte Frames Transmitted without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="GTBFT1518" offset="0x1130" rw="R" size="4" initval="0x00000000" caption="Greater Than 1518 Byte Frames Transmitted Register">
          <bitfield name="NFTX" caption="Greater than 1518 Byte Frames Transmitted without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="TUR" offset="0x1134" rw="R" size="4" initval="0x00000000" caption="Transmit Underruns Register">
          <bitfield name="TXUNR" caption="Transmit Underruns" mask="0x3FF"/>
        </register>
        <register name="SCF" offset="0x1138" rw="R" size="4" initval="0x00000000" caption="Single Collision Frames Register">
          <bitfield name="SCOL" caption="Single Collision" mask="0x3FFFF"/>
        </register>
        <register name="MCF" offset="0x113C" rw="R" size="4" initval="0x00000000" caption="Multiple Collision Frames Register">
          <bitfield name="MCOL" caption="Multiple Collision" mask="0x3FFFF"/>
        </register>
        <register name="EC" offset="0x1140" rw="R" size="4" initval="0x00000000" caption="Excessive Collisions Register">
          <bitfield name="XCOL" caption="Excessive Collisions" mask="0x3FF"/>
        </register>
        <register name="LC" offset="0x1144" rw="R" size="4" initval="0x00000000" caption="Late Collisions Register">
          <bitfield name="LCOL" caption="Late Collisions" mask="0x3FF"/>
        </register>
        <register name="DTF" offset="0x1148" rw="R" size="4" initval="0x00000000" caption="Deferred Transmission Frames Register">
          <bitfield name="DEFT" caption="Deferred Transmission" mask="0x3FFFF"/>
        </register>
        <register name="CSE" offset="0x114C" rw="R" size="4" initval="0x00000000" caption="Carrier Sense Errors Register">
          <bitfield name="CSR" caption="Carrier Sense Error" mask="0x3FF"/>
        </register>
        <register name="ORLO" offset="0x1150" rw="R" size="4" initval="0x00000000" caption="Octets Received [31:0] Received">
          <bitfield name="RXO" caption="Received Octets" mask="0xFFFFFFFF"/>
        </register>
        <register name="ORHI" offset="0x1154" rw="R" size="4" initval="0x00000000" caption="Octets Received [47:32] Received">
          <bitfield name="RXO" caption="Received Octets" mask="0xFFFF"/>
        </register>
        <register name="FR" offset="0x1158" rw="R" size="4" initval="0x00000000" caption="Frames Received Register">
          <bitfield name="FRX" caption="Frames Received without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="BCFR" offset="0x115C" rw="R" size="4" initval="0x00000000" caption="Broadcast Frames Received Register">
          <bitfield name="BFRX" caption="Broadcast Frames Received without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="MFR" offset="0x1160" rw="R" size="4" initval="0x00000000" caption="Multicast Frames Received Register">
          <bitfield name="MFRX" caption="Multicast Frames Received without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="PFR" offset="0x1164" rw="R" size="4" initval="0x00000000" caption="Pause Frames Received Register">
          <bitfield name="PFRX" caption="Pause Frames Received Register" mask="0xFFFF"/>
        </register>
        <register name="BFR64" offset="0x1168" rw="R" size="4" initval="0x00000000" caption="64 Byte Frames Received Register">
          <bitfield name="NFRX" caption="64 Byte Frames Received without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="TBFR127" offset="0x116C" rw="R" size="4" initval="0x00000000" caption="65 to 127 Byte Frames Received Register">
          <bitfield name="NFRX" caption="65 to 127 Byte Frames Received without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="TBFR255" offset="0x1170" rw="R" size="4" initval="0x00000000" caption="128 to 255 Byte Frames Received Register">
          <bitfield name="NFRX" caption="128 to 255 Byte Frames Received without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="TBFR511" offset="0x1174" rw="R" size="4" initval="0x00000000" caption="256 to 511Byte Frames Received Register">
          <bitfield name="NFRX" caption="256 to 511 Byte Frames Received without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="TBFR1023" offset="0x1178" rw="R" size="4" initval="0x00000000" caption="512 to 1023 Byte Frames Received Register">
          <bitfield name="NFRX" caption="512 to 1023 Byte Frames Received without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="TBFR1518" offset="0x117C" rw="R" size="4" initval="0x00000000" caption="1024 to 1518 Byte Frames Received Register">
          <bitfield name="NFRX" caption="1024 to 1518 Byte Frames Received without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="TMXBFR" offset="0x1180" rw="R" size="4" initval="0x00000000" caption="1519 to Maximum Byte Frames Received Register">
          <bitfield name="NFRX" caption="1519 to Maximum Byte Frames Received without Error" mask="0xFFFFFFFF"/>
        </register>
        <register name="UFR" offset="0x1184" rw="R" size="4" initval="0x00000000" caption="Undersize Frames Received Register">
          <bitfield name="UFRX" caption="Undersize Frames Received" mask="0x3FF"/>
        </register>
        <register name="OFR" offset="0x1188" rw="R" size="4" initval="0x00000000" caption="Oversize Frames Received Register">
          <bitfield name="OFRX" caption="Oversized Frames Received" mask="0x3FF"/>
        </register>
