Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.10/PIC32CK-SG01/atdf/PIC32CK1025SG01100.atdf
        <register name="ACPR" offset="0x10" rw="RW" size="4" access-size="4" caption="TPIU Asynchronous Clock Prescaler Register">
          <bitfield name="SWOSCALER" caption="SWO baud rate prescaler" mask="0xFFFF"/>
        </register>
        <register name="SPPR" offset="0xF0" rw="RW" size="4" access-size="4" caption="TPIU Selected Pin Protocol Register">
          <bitfield name="TXMODE" caption="" mask="0x3" values="SPPR__TXMODE"/>
        </register>
        <register name="FFSR" offset="0x300" rw="R" size="4" access-size="4" caption="TPIU Formatter and Flush Status Register">
          <bitfield name="FInProg" caption="Flush in progress" mask="0x1"/>
          <bitfield name="FtStopped" caption="Formatter stopped" mask="0x2"/>
          <bitfield name="TCPresent" caption="TRACECTL pin is present" mask="0x4"/>
          <bitfield name="FtNonStop" caption="Non-stop formatter" mask="0x8"/>
        </register>
        <register name="FFCR" offset="0x304" rw="RW" size="4" access-size="4" initval="0x00000000" caption="TPIU Formatter and Flush Control Register">
          <bitfield name="EnFmt" caption="Output formatting mode" mask="0x3" values="FFCR__EnFmt"/>
          <bitfield name="FOnMan" caption="Flush On Manual" mask="0x40"/>
          <bitfield name="TrigIn" caption="Trigger input asserted" mask="0x100"/>
        </register>
        <register name="PSCR" offset="0x308" rw="RW" size="4" access-size="4" caption="TPIU Periodic Synchronization Control Register">
          <bitfield name="PSCount" caption="Periodic Synchronization Count" mask="0x1F"/>
        </register>
        <register name="LAR" offset="0xFB0" rw="W" size="4" access-size="4" caption="TPIU Software Lock Access Register">
          <bitfield name="KEY" caption="Lock access control" mask="0xFFFFFFFF" values="LAR__KEY"/>
        </register>
        <register name="LSR" offset="0xFB4" rw="R" size="4" access-size="4" caption="TPIU Software Lock Status Register">
          <bitfield name="SLI" caption="Software Lock implemented" mask="0x1"/>
          <bitfield name="SLK" caption="Software Lock status" mask="0x2"/>
          <bitfield name="nTT" caption="Not thirty-two bit" mask="0x4"/>
        </register>
        <register name="DEVID" offset="0xFC8" rw="R" size="4" access-size="4" caption="TPIU Device Identifier Register">
          <bitfield name="DWTENA" caption="" mask="0x1000000"/>
        </register>
        <register name="DEVTYPE" offset="0xFCC" rw="R" size="4" access-size="4" caption="TPIU Device Type Register">
          <bitfield name="MAJOR" caption="Major type" mask="0xF"/>
          <bitfield name="SUB" caption="Sub-type" mask="0xF0"/>
        </register>
        <register name="PIDR4" offset="0xFD0" rw="R" size="4" access-size="4" caption="TPIU Peripheral Identification Register 4">
          <bitfield name="DES_2" caption="JEP106 continuation code" mask="0xF"/>
          <bitfield name="SIZE" caption="4KB count" mask="0xF0"/>
        </register>
        <register name="PIDR5" offset="0xFD4" rw="R" size="4" access-size="4" initval="0x00000000" caption="TPIU Peripheral Identification Register 5">
        </register>
        <register name="PIDR6" offset="0xFD8" rw="R" size="4" access-size="4" initval="0x00000000" caption="TPIU Peripheral Identification Register 6">
        </register>
        <register name="PIDR7" offset="0xFDC" rw="R" size="4" access-size="4" initval="0x00000000" caption="TPIU Peripheral Identification Register 7">
        </register>
        <register name="PIDR0" offset="0xFE0" rw="R" size="4" access-size="4" caption="TPIU Peripheral Identification Register 0">
          <bitfield name="PART_0" caption="Part number bits[7:0]" mask="0xFF"/>
        </register>
        <register name="PIDR1" offset="0xFE4" rw="R" size="4" access-size="4" caption="TPIU Peripheral Identification Register 1">
          <bitfield name="PART_1" caption="Part number bits[11:8]" mask="0xF"/>
          <bitfield name="DES_0" caption="JEP106 identification code bits [3:0]" mask="0xF0"/>
        </register>
        <register name="PIDR2" offset="0xFE8" rw="R" size="4" access-size="4" caption="TPIU Peripheral Identification Register 2">
          <bitfield name="DES_1" caption="JEP106 identification code bits[6:4]" mask="0x7"/>
          <bitfield name="JEDEC" caption="JEDEC assignee value is used" mask="0x8"/>
          <bitfield name="REVISION" caption="Component revision" mask="0xF0"/>
        </register>
        <register name="PIDR3" offset="0xFEC" rw="R" size="4" access-size="4" caption="TPIU Peripheral Identification Register 3">
          <bitfield name="CMOD" caption="Customer Modified" mask="0xF"/>
          <bitfield name="REVAND" caption="RevAnd" mask="0xF0"/>
        </register>
        <register name="CIDR0" offset="0xFF0" rw="R" size="4" access-size="4" initval="0x0000000D" caption="TPIU Component Identification Register 0">
          <bitfield name="PRMBL_0" caption="CoreSight component identification preamble" mask="0xFF"/>
        </register>
        <register name="CIDR1" offset="0xFF4" rw="R" size="4" access-size="4" initval="0x00000090" caption="TPIU Component Identification Register 1">
          <bitfield name="PRMBL_1" caption="CoreSight component identification preamble" mask="0xF"/>
          <bitfield name="CLASS" caption="CoreSight component class" mask="0xF0"/>
        </register>
        <register name="CIDR2" offset="0xFF8" rw="R" size="4" access-size="4" initval="0x00000005" caption="TPIU Component Identification Register 2">
          <bitfield name="PRMBL_2" caption="CoreSight component identification preamble" mask="0xFF"/>
        </register>
        <register name="CIDR3" offset="0xFFC" rw="R" size="4" access-size="4" initval="0x000000B1" caption="TPIU Component Identification Register 3">
          <bitfield name="PRMBL_3" caption="CoreSight component identification preamble" mask="0xFF"/>
        </register>
      </register-group>
      <value-group name="SPPR__TXMODE">
        <value name="PARALLEL" caption="Parallel trace port mode" value="0"/>
        <value name="MAN" caption="Asynchronous SWO, using Manchester encoding" value="1"/>
        <value name="NRZ" caption="Asynchronous SWO, using NRZ encoding" value="2"/>
      </value-group>
